package com.example.autofillrough1;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.util.Log;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.AutoCompleteTextView;
import android.widget.EditText;
import android.widget.Spinner;

import org.json.JSONArray;
import org.json.JSONException;
import org.json.JSONObject;

import java.util.ArrayList;

public class MainActivity extends AppCompatActivity {

    private AutoCompleteTextView userName;
    private EditText userTambon, userProvince, userCode;

    private String jsonString = "{\n" +
            "  \"user_detail\": [\n" +
            "    {\n" +
            "      \"id\": 1,\n" +
            "      \"name\": \"คลองท่อมเหนือ\",\n" +
            "      \"tambon\": \"คลองท่อม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81120\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 2,\n" +
            "      \"name\": \"คลองท่อมใต้\",\n" +
            "      \"tambon\": \"คลองท่อม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81120\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 3,\n" +
            "      \"name\": \"คลองพน\",\n" +
            "      \"tambon\": \"คลองท่อม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81170\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 4,\n" +
            "      \"name\": \"ทรายขาว\",\n" +
            "      \"tambon\": \"คลองท่อม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81170\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 5,\n" +
            "      \"name\": \"พรุดินนา\",\n" +
            "      \"tambon\": \"คลองท่อม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81120\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 6,\n" +
            "      \"name\": \"ห้วยน้ำขาว\",\n" +
            "      \"tambon\": \"คลองท่อม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81120\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 7,\n" +
            "      \"name\": \"เพหลา\",\n" +
            "      \"tambon\": \"คลองท่อม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81120\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 8,\n" +
            "      \"name\": \"คีรีวง\",\n" +
            "      \"tambon\": \"ปลายพระยา\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81160\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 9,\n" +
            "      \"name\": \"ปลายพระยา\",\n" +
            "      \"tambon\": \"ปลายพระยา\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81160\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 10,\n" +
            "      \"name\": \"เขาต่อ\",\n" +
            "      \"tambon\": \"ปลายพระยา\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81160\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 11,\n" +
            "      \"name\": \"เขาเขน\",\n" +
            "      \"tambon\": \"ปลายพระยา\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81160\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 12,\n" +
            "      \"name\": \"ดินอุดม\",\n" +
            "      \"tambon\": \"ลำทับ\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81190\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 13,\n" +
            "      \"name\": \"ดินแดง\",\n" +
            "      \"tambon\": \"ลำทับ\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81190\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 14,\n" +
            "      \"name\": \"ทุ่งไทรทอง\",\n" +
            "      \"tambon\": \"ลำทับ\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81190\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 15,\n" +
            "      \"name\": \"ลำทับ\",\n" +
            "      \"tambon\": \"ลำทับ\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81190\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 16,\n" +
            "      \"name\": \"คลองยา\",\n" +
            "      \"tambon\": \"อ่าวลึก\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81110\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 17,\n" +
            "      \"name\": \"คลองหิน\",\n" +
            "      \"tambon\": \"อ่าวลึก\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81110\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 18,\n" +
            "      \"name\": \"นาเหนือ\",\n" +
            "      \"tambon\": \"อ่าวลึก\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81110\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 19,\n" +
            "      \"name\": \"บ้านกลาง\",\n" +
            "      \"tambon\": \"อ่าวลึก\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81110\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 20,\n" +
            "      \"name\": \"อ่าวลึกน้อย\",\n" +
            "      \"tambon\": \"อ่าวลึก\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81110\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 21,\n" +
            "      \"name\": \"อ่าวลึกเหนือ\",\n" +
            "      \"tambon\": \"อ่าวลึก\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81110\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 22,\n" +
            "      \"name\": \"อ่าวลึกใต้\n\",\n" +
            "      \"tambon\": \"อ่าวลึก\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81110\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 23,\n" +
            "      \"name\": \"เขาใหญ่\",\n" +
            "      \"tambon\": \"อ่าวลึก\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81110\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 24,\n" +
            "      \"name\": \"แหลมสัก\",\n" +
            "      \"tambon\": \"อ่าวลึก\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81110\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 25,\n" +
            "      \"name\": \"คลองยาง\",\n" +
            "      \"tambon\": \"เกาะลันตา\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81120\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 26,\n" +
            "      \"name\": \"ศาลาด่าน\",\n" +
            "      \"tambon\": \"เกาะลันตา\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81150\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 27,\n" +
            "      \"name\": \"เกาะกลาง\",\n" +
            "      \"tambon\": \"เกาะลันตา\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81120\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 28,\n" +
            "      \"name\": \"เกาะลันตาน้อย\",\n" +
            "      \"tambon\": \"เกาะลันตา\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81150\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 29,\n" +
            "      \"name\": \"เกาะลันตาใหญ่\",\n" +
            "      \"tambon\": \"เกาะลันตา\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81150\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 30,\n" +
            "      \"name\": \"พรุเตียว\",\n" +
            "      \"tambon\": \"เขาพนม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81140\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 31,\n" +
            "      \"name\": \"สินปุน\",\n" +
            "      \"tambon\": \"เขาพนม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"80240\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 32,\n" +
            "      \"name\": \"หน้าเขา\",\n" +
            "      \"tambon\": \"เขาพนม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81140\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 33,\n" +
            "      \"name\": \"เขาดิน\",\n" +
            "      \"tambon\": \"เขาพนม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81140\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 34,\n" +
            "      \"name\": \"เขาพนม\",\n" +
            "      \"tambon\": \"เขาพนม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81140\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 35,\n" +
            "      \"name\": \"โคกหาร\",\n" +
            "      \"tambon\": \"เขาพนม\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"80240\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 36,\n" +
            "      \"name\": \"กระบี่น้อย\",\n" +
            "      \"tambon\": \"เมืองกระบี่\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81000\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 37,\n" +
            "      \"name\": \"กระบี่ใหญ่\",\n" +
            "      \"tambon\": \"เมืองกระบี่\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81000\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 38,\n" +
            "      \"name\": \"คลองประสงค์\",\n" +
            "      \"tambon\": \"เมืองกระบี่\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81000\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 39,\n" +
            "      \"name\": \"ทับปริก\",\n" +
            "      \"tambon\": \"เมืองกระบี่\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81000\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 40,\n" +
            "      \"name\": \"ปากน้ำ\",\n" +
            "      \"tambon\": \"เมืองกระบี่\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81000\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 41,\n" +
            "      \"name\": \"หนองทะเล\",\n" +
            "      \"tambon\": \"เมืองกระบี่\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81180\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 42,\n" +
            "      \"name\": \"อ่าวนาง\",\n" +
            "      \"tambon\": \"เมืองกระบี่\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81180\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 43,\n" +
            "      \"name\": \"เขาคราม\",\n" +
            "      \"tambon\": \"เมืองกระบี่\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81000\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 44,\n" +
            "      \"name\": \"เขาทอง\",\n" +
            "      \"tambon\": \"เมืองกระบี่\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81000\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 45,\n" +
            "      \"name\": \"ไสไทย\",\n" +
            "      \"tambon\": \"เมืองกระบี่\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81000\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 46,\n" +
            "      \"name\": \"คลองขนาน\",\n" +
            "      \"tambon\": \"เหนือคลอง\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81130\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 47,\n" +
            "      \"name\": \"คลองเขม้า\",\n" +
            "      \"tambon\": \"เหนือคลอง\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81130\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 48,\n" +
            "      \"name\": \"ตลิ่งชัน\",\n" +
            "      \"tambon\": \"เหนือคลอง\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81130\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 49,\n" +
            "      \"name\": \"ปกาสัย\",\n" +
            "      \"tambon\": \"เหนือคลอง\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81130\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 50,\n" +
            "      \"name\": \"ห้วยยูง\",\n" +
            "      \"tambon\": \"เหนือคลอง\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81130\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 51,\n" +
            "      \"name\": \"เกาะศรีบอยา\",\n" +
            "      \"tambon\": \"เหนือคลอง\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81130\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 52,\n" +
            "      \"name\": \"เหนือคลอง\",\n" +
            "      \"tambon\": \"เหนือคลอง\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81130\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 53,\n" +
            "      \"name\": \"โคกยาง\",\n" +
            "      \"tambon\": \"เหนือคลอง\",\n" +
            "      \"province\": \"กระบี่\",\n" +
            "      \"code\": \"81130\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 54,\n" +
            "      \"name\": \"คลองต้นไทร\",\n" +
            "      \"tambon\": \"คลองสาน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 55,\n" +
            "      \"name\": \"คลองสาน\",\n" +
            "      \"tambon\": \"คลองสาน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 56,\n" +
            "      \"name\": \"บางลำภูล่าง\",\n" +
            "      \"tambon\": \"คลองสาน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 57,\n" +
            "      \"name\": \"สมเด็จเจ้าพระยา\",\n" +
            "      \"tambon\": \"คลองสาน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 58,\n" +
            "      \"name\": \"ทรายกองดิน\",\n" +
            "      \"tambon\": \"คลองสามวา\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10510\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 59,\n" +
            "      \"name\": \"ทรายกองดินใต้\",\n" +
            "      \"tambon\": \"คลองสามวา\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10510\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 60,\n" +
            "      \"name\": \"บางชัน\",\n" +
            "      \"tambon\": \"คลองสามวา\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10510\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 61,\n" +
            "      \"name\": \"สามวาตะวันตก\",\n" +
            "      \"tambon\": \"คลองสามวา\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10510\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 62,\n" +
            "      \"name\": \"สามวาตะวันออก\",\n" +
            "      \"tambon\": \"คลองสามวา\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10510\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 63,\n" +
            "      \"name\": \"คลองตัน\",\n" +
            "      \"tambon\": \"คลองเตย\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10110\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 64,\n" +
            "      \"name\": \"คลองเตย\",\n" +
            "      \"tambon\": \"คลองเตย\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10110\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 65,\n" +
            "      \"name\": \"พระโขนง\",\n" +
            "      \"tambon\": \"คลองเตย\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10110\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 66,\n" +
            "      \"name\": \"คันนายาว\",\n" +
            "      \"tambon\": \"คันนายาว\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10230\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 67,\n" +
            "      \"name\": \"รามอินทรา\",\n" +
            "      \"tambon\": \"คันนายาว\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10230\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 68,\n" +
            "      \"name\": \"จตุจักร\",\n" +
            "      \"tambon\": \"จตุจักร\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10900\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 69,\n" +
            "      \"name\": \"จอมพล\",\n" +
            "      \"tambon\": \"จตุจักร\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10900\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 70,\n" +
            "      \"name\": \"จันทรเกษม\",\n" +
            "      \"tambon\": \"จตุจักร\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10900\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 71,\n" +
            "      \"name\": \"ลาดยาว\",\n" +
            "      \"tambon\": \"จตุจักร\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10900\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 72,\n" +
            "      \"name\": \"เสนานิคม\",\n" +
            "      \"tambon\": \"จตุจักร\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10900\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 73,\n" +
            "      \"name\": \"จอมทอง\",\n" +
            "      \"tambon\": \"จอมทอง\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10150\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 74,\n" +
            "      \"name\": \"บางขุนเทียน\",\n" +
            "      \"tambon\": \"จอมทอง\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10150\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 76,\n" +
            "      \"name\": \"บางมด\",\n" +
            "      \"tambon\": \"จอมทอง\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10150\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 77,\n" +
            "      \"name\": \"ดอนเมือง\",\n" +
            "      \"tambon\": \"ดอนเมือง\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10210\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 78,\n" +
            "      \"name\": \"สนามบิน\",\n" +
            "      \"tambon\": \"ดอนเมือง\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10210\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 79,\n" +
            "      \"name\": \"สีกัน\",\n" +
            "      \"tambon\": \"ดอนเมือง\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10210\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 80,\n" +
            "      \"name\": \"ดินแดง\",\n" +
            "      \"tambon\": \"ดินแดง\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10400\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 81,\n" +
            "      \"name\": \"ดุสิต\",\n" +
            "      \"tambon\": \"ดุสิต\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10300\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 82,\n" +
            "      \"name\": \"ถนนนครไชยศรี\",\n" +
            "      \"tambon\": \"ดุสิต\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10300\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 83,\n" +
            "      \"name\": \"วชิรพยาบาล\",\n" +
            "      \"tambon\": \"ดุสิต\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10300\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 84,\n" +
            "      \"name\": \"สวนจิตรลดา\",\n" +
            "      \"tambon\": \"ดุสิต\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10300\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 85,\n" +
            "      \"name\": \"สี่แยกมหานาค\",\n" +
            "      \"tambon\": \"ดุสิต\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10300\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 86,\n" +
            "      \"name\": \"คลองชักพระ\",\n" +
            "      \"tambon\": \"ตลิ่งชัน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10170\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 87,\n" +
            "      \"name\": \"ฉิมพลี\",\n" +
            "      \"tambon\": \"ตลิ่งชัน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10170\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 88,\n" +
            "      \"name\": \"ตลิ่งชัน\",\n" +
            "      \"tambon\": \"ตลิ่งชัน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10170\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 89,\n" +
            "      \"name\": \"บางพรม\",\n" +
            "      \"tambon\": \"ตลิ่งชัน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10170\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 90,\n" +
            "      \"name\": \"บางระมาด\",\n" +
            "      \"tambon\": \"ตลิ่งชัน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10170\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 91,\n" +
            "      \"name\": \"บางเชือกหนัง\",\n" +
            "      \"tambon\": \"ตลิ่งชัน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10170\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 92,\n" +
            "      \"name\": \"ทวีวัฒนา\",\n" +
            "      \"tambon\": \"ทวีวัฒนา\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10170\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 93,\n" +
            "      \"name\": \"ศาลาธรรมสพน์\",\n" +
            "      \"tambon\": \"ทวีวัฒนา\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10170\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 94,\n" +
            "      \"name\": \"ทุ่งครุ\",\n" +
            "      \"tambon\": \"ทุ่งครุ\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10140\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 95,\n" +
            "      \"name\": \"บางมด\",\n" +
            "      \"tambon\": \"ทุ่งครุ\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10140\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 96,\n" +
            "      \"name\": \"ดาวคะนอง\",\n" +
            "      \"tambon\": \"ธนบุรี\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 97,\n" +
            "      \"name\": \"ตลาดพลู\",\n" +
            "      \"tambon\": \"ธนบุรี\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 98,\n" +
            "      \"name\": \"บางยี่เรือ\",\n" +
            "      \"tambon\": \"ธนบุรี\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 99,\n" +
            "      \"name\": \"บุคคโล\",\n" +
            "      \"tambon\": \"ธนบุรี\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 100,\n" +
            "      \"name\": \"วัดกัลยาณ์\",\n" +
            "      \"tambon\": \"ธนบุรี\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 101,\n" +
            "      \"name\": \"สำเหร่\",\n" +
            "      \"tambon\": \"ธนบุรี\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 102,\n" +
            "      \"name\": \"หิรัญรูจี\",\n" +
            "      \"tambon\": \"ธนบุรี\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 103,\n" +
            "      \"name\": \"บางขุนนนท์\",\n" +
            "      \"tambon\": \"บางกอกน้อย\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10700\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 104,\n" +
            "      \"name\": \"บางขุนศรี\",\n" +
            "      \"tambon\": \"บางกอกน้อย\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10700\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 105,\n" +
            "      \"name\": \"บ้านช่างหล่อ\",\n" +
            "      \"tambon\": \"บางกอกน้อย\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10700\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 106,\n" +
            "      \"name\": \"ศิริราช\",\n" +
            "      \"tambon\": \"บางกอกน้อย\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10700\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 107,\n" +
            "      \"name\": \"อรุณอัมรินทร์\",\n" +
            "      \"tambon\": \"บางกอกน้อย\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10700\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 108,\n" +
            "      \"name\": \"วัดท่าพระ\",\n" +
            "      \"tambon\": \"บางกอกใหญ่\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 109,\n" +
            "      \"name\": \"วัดอรุณ\",\n" +
            "      \"tambon\": \"บางกอกใหญ่\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10600\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 110,\n" +
            "      \"name\": \"คลองจั่น\",\n" +
            "      \"tambon\": \"บางกะปิ\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10240\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 111,\n" +
            "      \"name\": \"หัวหมาก\",\n" +
            "      \"tambon\": \"บางกะปิ\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10240\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 112,\n" +
            "      \"name\": \"ท่าข้าม\",\n" +
            "      \"tambon\": \"บางขุนเทียน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10150\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 113,\n" +
            "      \"name\": \"แสมดำ\",\n" +
            "      \"tambon\": \"บางขุนเทียน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10150\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 114,\n" +
            "      \"name\": \"บางคอแหลม\",\n" +
            "      \"tambon\": \"บางคอแหลม\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10120\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 115,\n" +
            "      \"name\": \"บางโคล่\",\n" +
            "      \"tambon\": \"บางคอแหลม\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10120\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 116,\n" +
            "      \"name\": \"วัดพระยาไกร\",\n" +
            "      \"tambon\": \"บางคอแหลม\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10120\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 117,\n" +
            "      \"name\": \"บางซื่อ\",\n" +
            "      \"tambon\": \"บางซื่อ\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10800\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 118,\n" +
            "      \"name\": \"วงศ์สว่าง\",\n" +
            "      \"tambon\": \"บางซื่อ\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10800\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 119,\n" +
            "      \"name\": \"บางนา\",\n" +
            "      \"tambon\": \"บางนา\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10260\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 120,\n" +
            "      \"name\": \"บางบอน\",\n" +
            "      \"tambon\": \"บางบอน\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10150\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 121,\n" +
            "      \"name\": \"บางบำหรุ\",\n" +
            "      \"tambon\": \"บางพลัด\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10700\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 122,\n" +
            "      \"name\": \"บางพลัด\",\n" +
            "      \"tambon\": \"บางพลัด\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10700\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 123,\n" +
            "      \"name\": \"บางยี่ขัน\",\n" +
            "      \"tambon\": \"บางพลัด\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10700\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 124,\n" +
            "      \"name\": \"บางอ้อ\",\n" +
            "      \"tambon\": \"บางพลัด\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10700\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 125,\n" +
            "      \"name\": \"บางรัก\",\n" +
            "      \"tambon\": \"บางรัก\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10500\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 126,\n" +
            "      \"name\": \"มหาพฤฒาราม\",\n" +
            "      \"tambon\": \"บางรัก\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10500\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 127,\n" +
            "      \"name\": \"สีลม\",\n" +
            "      \"tambon\": \"บางรัก\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10500\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 128,\n" +
            "      \"name\": \"สี่พระยา\",\n" +
            "      \"tambon\": \"บางรัก\",\n" +
            "      \"province\": \"กรุงเทพมหานคร\",\n" +
            "      \"code\": \"10500\"\n" +
            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +
//            "    {\n" +
//            "      \"id\": 128,\n" +
//            "      \"name\": \"สี่พระยา\",\n" +
//            "      \"tambon\": \"บางรัก\",\n" +
//            "      \"province\": \"กรุงเทพมหานคร\",\n" +
//            "      \"code\": \"10500\"\n" +
//            "    },\n" +

            "  ]\n" +
            "}";

    private ArrayList<User> userList;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        initView();

        userList = extractUser(jsonString);

        UserAdapter userAdapter = new UserAdapter(this, R.layout.user_raw_layout, userList);

        userName.setAdapter(userAdapter);
        userName.setThreshold(1);

        userName.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {

                User user = (User) parent.getItemAtPosition(position);

                userName.setText(user.getName());
                userTambon.setText(user.getTambon());
                userProvince.setText(user.getProvince());
                userCode.setText(user.getCode());

            }
        });

    }

    private void initView() {
        userName = findViewById(R.id.user_name);
        userTambon = findViewById(R.id.user_tambon);
        userProvince = findViewById(R.id.user_province);
        userCode = findViewById(R.id.user_code);

        userList = new ArrayList<>();

    }


    private ArrayList<User> extractUser(String jsonString) {
        ArrayList<User> list = new ArrayList<>();

        try {
            JSONObject rootJO = new JSONObject(jsonString);

            JSONArray userJA = rootJO.getJSONArray("user_detail");

            for (int i = 0; i < userJA.length(); i++) {

                JSONObject jo = userJA.getJSONObject(i);

                int id = jo.getInt("id");
                String name = jo.getString("name");
                String tambon = jo.getString("tambon");
                String province = jo.getString("province");
                String code = jo.getString("code");

                User user = new User(id, name, tambon, province, code);

                list.add(user);
            }

        } catch (JSONException e) {
            e.printStackTrace();
        }

        return list;
    }


}
